{
	"PoW" : {
		"name" : "Proof of Work",
		"details":[
					"Faster block creation is directly proportional to the computational power.",
					"High energy consumption (Bitcoin consume roughly 73.12 TWh).",
					"Always associated with some kind of token as incentives.",
					"Parties with higher computation power have a more mining rate (Which in a way centralized the mining process).",
					"Vulnerable to the 51% attack."
		]
	},
	"PoS" : {
		"name" : "Proof of Stake",
		"details":[
					"Energy-efficient than the proof of work system.",
					"Validators can only mine blocks.",
					"Chance of becoming a validator is directly proportional to the stake deposit. Which is fairer in the real world compares to PoW. ",
					"More decentralized mining that PoW because more computing power does not guarantee the more chance for mining.",
					"Make 51% not practical because to manipulate the network it has to take over 51% of the market cap.",
					"Favors rich people. (Bring additional risks)."
		]
	},
	"PoET" : {
		"name" : "Proof Of Elapsed Time",
		"details":[
					"Validators are selected based on randomly assigned waiting time.",
					"This consensus mechanism can only work if there is a system in place to verify that nobody can run multiple nodes and that the assigned waiting time is actually random.  (So this inheritently permission-ed). And a special hardware level instruction by Intel ensures the safety and randomness. ."
		]
	},
	"PBFT" : {
		"name" : "Practical Byzantine Fault Tolerance",
		"details":[
					"Tolerates BFT faults like malicious nodes by assuming that there are independent node failures and manipulations.",
					"Vulnerable to 33% attack.",
					"Become more secure with the number of nodes increases.",
					"PFT is a promising consensus solution when the group of nodes is small but becomes inefficient for large networks. This is because each node must talk to every other node to keep the network secure, which can quickly grow into a huge communication cost as the amount of nodes scales upwards."
		]
	},
	"DPoW" : {
		"name" : "Distributed Proof of Work",
		"details":[
		]
	},
	"HashGraph" : {
		"name" : "HashGraph",
		"details":[
		]
	},
	"MainChain" : {
		"name" : "MainChain",
		"details":[
		]
	}

}